{
  "id": "1766599577762",
  "title": "Go Your Own Way",
  "slug": "go-your-own-way",
  "content": "<h3>We don't need a committee to sell airline tickets</h3><p>I'm not an \"industry expert\" in the credentialed sense — but I've spent enough time inside hotel and airline distribution to see how <em>needlessly</em> complex it has become, and how often that complexity actively destroys value.&nbsp;<span style=\"font-family: Inter, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, sans-serif;\">When I worked for one of the largest room sellers in Southeast Asia, I learned something that never quite left me:</span></p>\n\n<p><strong>We would sometimes lose money on a hotel room by design.</strong></p>\n\n<p>Not because demand was weak — but because:</p>\n<ul>\n<li>We needed to hit a <strong>quota</strong> with one wholesaler to protect our contracted rates</li>\n<li>We were buying the same room back at a <strong>markup</strong> from another partner</li>\n<li>Then discounting it <strong>below market</strong> just to satisfy a different contractual obligation</li>\n</ul>\n\n<p>On paper, it all \"made sense.\"<br>In reality, it was circular arbitrage in service of distribution politics.</p>\n\n<div class=\"quote-highlight\">And that was hotels.</div>\n\n<hr>\n\n<h2>Hotel Distribution: A Maze of Incentives, Not Value</h2>\n\n<p>Modern hotel distribution isn't really about rooms — it's about <em>channel management</em>:</p>\n\n<ul>\n<li>Direct booking channels</li>\n<li>OTAs</li>\n<li>Wholesalers</li>\n<li>GDS pipes originally built for travel agents</li>\n<li>Rate parity clauses and quiet exceptions</li>\n</ul>\n\n<p>Each layer has its own economics. Each partner wants volume, protection, and margin. The result is a system where <strong>pricing decisions are often driven more by contractual gravity than consumer demand</strong>.</p>\n\n<p>Academic and industry research backs this up:</p>\n<ul>\n<li>Wholesale distribution creates opacity and margin leakage</li>\n<li>OTA dependency constrains pricing flexibility</li>\n<li>Hotels routinely trade yield for visibility</li>\n</ul>\n\n<p>Which explains why you can end up discounting a room <em>you could have sold directly</em> — simply to keep peace across the channel ecosystem.</p>\n\n<hr>\n\n<h2>Airlines Are Even Worse</h2>\n\n<p>Airline revenue management <em>should</em> be elegant.</p>\n\n<p>At its heart, it's about one thing:</p>\n\n<blockquote><strong>Availability is the lever.</strong> Who gets which seat, at what price, under which conditions.</blockquote>\n\n<p>But decades of layering have buried that elegance under bureaucracy:</p>\n\n<ul>\n<li>Fare classes and fare families</li>\n<li>90+ restriction categories</li>\n<li>Point-of-sale rules</li>\n<li>Origin/destination logic</li>\n<li>Interline and codeshare constraints</li>\n<li>Data brokers and processors taking a cut at every step</li>\n</ul>\n\n<p>Each layer is supported by a vendor.<br>Each vendor takes a slice.<br>Each \"standard\" adds inertia.</p>\n\n<p>Which is why the most valuable thing ITA Software ever built wasn't flight search — it was <strong>revenue management and availability optimization</strong>.</p>\n\n<p>And why it's still astonishing that, after Google acquired ITA, that same class of software was later offered to airlines for <em>a rounding error</em> compared to what Google paid.</p>\n\n<hr>\n\n<h2>The Industry's Favorite Mistake: Waiting for Standards to Save It</h2>\n\n<p>Airlines and hotels keep hoping for an industry-wide rescue:</p>\n\n<ul>\n<li>New distribution standards</li>\n<li>Harmonized schemas</li>\n<li>Another working group</li>\n<li>Another round of consensus-driven negotiation</li>\n</ul>\n\n<p>It resembles the browser wars of the late 1990s — except this time, the industry <em>chose</em> fragmentation and then tried to standardize its way out of it.</p>\n\n<p>The problem is simple:</p>\n\n<blockquote><strong>Standards don't fix incentives.</strong></blockquote>\n\n<p>And in travel, incentives are the real problem.</p>\n\n<hr>\n\n<h2>The Way Out Is Owning the Sell</h2>\n\n<p>The uncomfortable truth:</p>\n\n<ul>\n<li>No standards body will rescue airline retailing</li>\n<li>OTAs will not voluntarily simplify hotel distribution</li>\n<li>Legacy intermediaries will not dismantle systems that pay them</li>\n</ul>\n\n<p>So airlines and hotels need to do something harder — but more honest:</p>\n\n<p><strong>Sell what you control. On platforms you own. With offers you define.</strong></p>\n\n<p>Simplify offers. Reduce artificial fare fences. Control availability directly. Treat distribution as a product, not a treaty.</p>\n\n<p>Complexity is not sophistication.<br>And in travel, it's long past time to tell the difference.</p>",
  "excerpt": "How complexity destroys value in hotel and airline retailing",
  "author": "Ashley Raiteri",
  "authorId": "ashley-raiteri",
  "status": "draft",
  "createdAt": "2025-12-24T18:06:17.762Z",
  "updatedAt": "2025-12-24T18:06:17.762Z",
  "carouselPreview": {
    "title": "Travel Distribution Is Broken",
    "excerpt": "How complexity destroys value in hotel and airline retailing",
    "meta": "",
    "icon": "chart",
    "backgroundGradient": ""
  }
}