{
  "slug": "modern-airline-retailing-fact-or-fiction",
  "title": "Modern Airline Retailing - Fact or Fiction?",
  "excerpt": "Is modern airline retailing genuinely transformative or just industry hype? A clear-eyed look at what's real, what works, and how airlines can actually succeed with retail.",
  "author": "Ann Cederhall",
  "status": "published",
  "publishedAt": "2024-03-15",
  "updatedAt": "2024-03-15",
  "type": "LINKEDIN POST",
  "category": "Airline Retailing",
  "readTimeMinutes": 6,
  "coverImage": null,
  "linkedinUrl": "https://www.linkedin.com/pulse/modern-airline-retailing-fact-fiction-ann-cederhall-qbkdf",
  "content": "<p>Many seem to have opinions on what is Modern Airline Retailing and those in denial keep saying that there is no such thing—despite several airlines being very successful with it. Year after year we see the growth of ancillary sales in the reports by Jay Sorensen and IdeaWorks. Airline profit margins are generally very low, and hopefully unlocking retail is one key to driving profitability.</p>\n\n<h2>What is an Offer and Order Management System?</h2>\n<p>An OMS orchestrates booked content into unified orders with business rules engines. These platforms integrate with CRM systems and sit atop either traditional or modern reservation systems, enabling multi-channel distribution and personalised dynamic bundling.</p>\n\n<h2>Order-Based vs PNR-Centric Systems</h2>\n<p>Unlike traditional PNR-centric systems, order-based systems price individual seats dynamically without RBD constraints. Orders persist indefinitely rather than being purged, and integrate flexibly with external systems. This is a fundamental architectural difference that enables true retail capabilities.</p>\n\n<h2>The Critical Distinction</h2>\n<p>Order-based systems aren't prerequisites for retailing—airlines can layer OMS capabilities onto legacy systems. NDC and IATA ONE Order adoption, while beneficial, remain optional for successful retail operations.</p>\n\n<h2>My Recommendation</h2>\n<p>Start-up airlines should adopt order-based systems from day one. Established carriers should explore OMS solutions layered onto existing infrastructure—you don't need to rip and replace to start retailing effectively.</p>\n\n<p><a href=\"https://www.linkedin.com/pulse/modern-airline-retailing-fact-fiction-ann-cederhall-qbkdf\" target=\"_blank\" rel=\"noopener noreferrer\">Continue Reading on LinkedIn →</a></p>"
}
