{
  "slug": "state-of-airline-retailing-2023",
  "title": "The State of Airline Retailing",
  "excerpt": "A global survey of 105 airline professionals reveals a sobering truth: not a single respondent thinks airlines are doing a 'very good job' at retailing.",
  "author": "Retailaer",
  "status": "published",
  "publishedAt": "2024-12-17",
  "updatedAt": "2024-12-17",
  "type": "WHITE PAPER",
  "category": "Airline Retailing",
  "readTimeMinutes": 4,
  "coverImage": null,
  "linkedinUrl": "https://www.meili.travel/white-papers/the-state-of-airline-retailing",
  "content": "<p class=\"intro-note\" style=\"background: linear-gradient(135deg, #f0f7f7 0%, #e8f4f4 100%); padding: 1.5rem; border-radius: 8px; border-left: 4px solid #0a5c5c; margin-bottom: 2rem;\"><strong>From our reading list:</strong> When Ann Cederhall and Airline Information surveyed 105 airline professionals worldwide, the results confirmed what we've seen across the industry: airlines know they need to do better at retailing, but most lack the systems to make it happen. This white paper should be required reading for any airline executive.</p>\n\n<h2>The Headline Finding</h2>\n<p><strong>Not a single survey respondent expressed the belief that airlines were doing a \"very good job\" at retailing.</strong> Just 14% of participants stated that airlines were doing a \"good job.\"</p>\n\n<h2>The Technology Gap</h2>\n<ul>\n<li><strong>62%</strong> said their airline does not utilize an Offer and Order Management System</li>\n<li><strong>64%</strong> said they are unable to sell partner ancillaries</li>\n</ul>\n\n<h2>Where Airlines Are Focusing</h2>\n<p>The survey highlighted that airlines are concentrating efforts on leveraging customer experience to drive revenues. Almost half (47%) of respondents indicated they are using their loyalty program to create personalized offers to customers.</p>\n\n<h2>The Opportunity Ahead</h2>\n<p>As Ann Cederhall notes: \"The opportunity that airlines have to create amazing customer experiences and lifelong loyal customers is so unbelievably huge that I believe we're on the cusp of a massive airline industry transformation that will put the customer front and centre once again.\"</p>\n\n<p>This is exactly what Retailaer was built to enable—helping airlines unlock their retail potential through customer-first offer and order management.</p>\n\n<p><a href=\"https://www.meili.travel/white-papers/the-state-of-airline-retailing\" target=\"_blank\" rel=\"noopener noreferrer\">Download the full white paper →</a></p>"
}
