{
  "slug": "three-pillars-of-ndc",
  "title": "The Three Pillars of NDC - Did We Achieve Them?",
  "excerpt": "Cost, Control, and Retail were NDC's founding goals. A decade later, how much progress have we actually made?",
  "author": "Ann Cederhall",
  "status": "published",
  "publishedAt": "2021-09-15",
  "updatedAt": "2021-09-15",
  "type": "LINKEDIN POST",
  "category": "Distribution",
  "readTimeMinutes": 7,
  "coverImage": null,
  "linkedinUrl": "https://www.linkedin.com/pulse/three-pillars-ndc-did-we-achieve-them-where-today-ann-cederhall",
  "content": "<p>When IATA filed Resolution 787 in 2013, NDC was built on three foundational pillars: Cost, Control, and Retail. Let's examine whether we've achieved them.</p>\n\n<h2>Pillar 1: Cost Reduction</h2>\n<p>Airlines sought to cut astronomical GDS distribution expenses—Lufthansa cited '$1 billion dollars a year' as motivation. NDC was meant to replicate low-cost carriers' direct-to-consumer model.</p>\n<p><strong>Status:</strong> Mixed results. Direct PSS bookings reduce expenses for some airlines, though implementation costs complicate calculations. Travel agents may face additional expenses.</p>\n\n<h2>Pillar 2: Control</h2>\n<p>Airlines wanted authority over what products were sold through which channels and to whom, eliminating intermediary manipulation of fares.</p>\n<p><strong>Status:</strong> Minimal achievement. Airlines abandoned the concept of directly ticketing orders. The battles about control are still around with little meaningful change despite NDC implementation.</p>\n\n<h2>Pillar 3: Retail</h2>\n<p>The core objective—enabling airlines to sell through any channel using the same capabilities available on their own websites.</p>\n<p><strong>Status:</strong> Disappointing performance. Research indicates 85% of airlines are unhappy with their websites. Only 15% excel, predominantly low-cost carriers and select network airlines who invested in flexible offer-management systems and customer-centric design.</p>\n\n<h2>The Path Forward</h2>\n<p>Success requires flexible backend systems paired with intuitive front-end interfaces—what IATA calls ONE Order combined with strong UX. Technology alone isn't enough; you need the right architecture and a genuine focus on customer experience.</p>\n\n<p><a href=\"https://www.linkedin.com/pulse/three-pillars-ndc-did-we-achieve-them-where-today-ann-cederhall\" target=\"_blank\" rel=\"noopener noreferrer\">Continue Reading on LinkedIn →</a></p>"
}
