{
  "slug": "to-ndc-or-not-ndc",
  "title": "To NDC or Not NDC - Is That the Question?",
  "excerpt": "After years of NDC discussions, the industry still needs 'demystifying' sessions. Perhaps we're asking the wrong questions entirely.",
  "author": "Ann Cederhall",
  "status": "published",
  "publishedAt": "2019-05-29",
  "updatedAt": "2019-05-29",
  "type": "LINKEDIN POST",
  "category": "Distribution",
  "readTimeMinutes": 5,
  "coverImage": null,
  "linkedinUrl": "https://www.linkedin.com/pulse/ndc-question-ann-cederhall",
  "content": "<p>Why, after 7 years, does the aviation industry still require 'demystifying NDC' conference sessions? The term 'NDC' (New Distribution Capability) is problematic because the word 'new' oversells the concept. Alternatives like 'Standardised Distribution Capabilities' would be more accurate.</p>\n\n<h2>The Definitional Confusion</h2>\n<p>Industry stakeholders have conflicting understandings—some view NDC as simply a standard, others as airline offer control, and still others as an ancillary revenue tool. This confusion undermines effective implementation.</p>\n\n<h2>The Questions We Should Be Asking</h2>\n<ul>\n<li>Does NDC merely provide an API for controlled offers through chosen channels?</li>\n<li>What responsibility falls on the storefront consuming the supplier's API?</li>\n<li>Is 'how the seller sells' actually more important than the technology itself?</li>\n</ul>\n\n<h2>A Practical Reality Check</h2>\n<p>For airlines where more than 75% of bookings occur on their own website, the return on software modernisation investment becomes questionable. Travellers are telling us that their digital experience doesn't meet their basic expectations—that's the real problem to solve.</p>\n\n<h2>What's Missing</h2>\n<p>No NDC standard exists for interline sales between airlines, and corporate booking engines haven't evolved at the pace of consumer tools. These are fundamental gaps.</p>\n\n<p>NDC is not a magic wand. It is only a very small part of the distribution puzzle. Your retail strategy is far more important—as is how you can improve the customer experience.</p>\n\n<p><a href=\"https://www.linkedin.com/pulse/ndc-question-ann-cederhall\" target=\"_blank\" rel=\"noopener noreferrer\">Continue Reading on LinkedIn →</a></p>"
}
