{
  "slug": "why-airlines-cant-explain-ndc",
  "title": "Why Can't Airlines Explain \"Why NDC\"?",
  "excerpt": "Airlines struggle to articulate NDC's necessity, often appearing as villains. Ann Cederhall explores the communication gap and what's really at stake.",
  "author": "Retailaer",
  "status": "published",
  "publishedAt": "2024-12-17",
  "updatedAt": "2024-12-17",
  "type": "LINKEDIN POST",
  "category": "Distribution",
  "readTimeMinutes": 6,
  "coverImage": null,
  "linkedinUrl": "https://www.linkedin.com/pulse/why-cant-airlines-explain-ndc-ann-cederhall-voe2f",
  "content": "<p class=\"intro-note\" style=\"background: linear-gradient(135deg, #f0f7f7 0%, #e8f4f4 100%); padding: 1.5rem; border-radius: 8px; border-left: 4px solid #0a5c5c; margin-bottom: 2rem;\"><strong>From our reading list:</strong> Ann Cederhall has been in the trenches of airline distribution since IATA filed Resolution 787. Her ability to cut through industry jargon and explain what's actually happening—and why—is invaluable. This piece tackles a question we hear constantly: why is NDC so hard to explain?</p>\n\n<h2>The Communication Gap</h2>\n<p>Ann contends that airlines struggle to articulate NDC's necessity, resulting in their portrayal as \"villains\" while travel agents and corporate buyers lack understanding of the modernization imperative.</p>\n\n<h2>The LCC Wake-Up Call</h2>\n<p>In the late 2000s, low-cost carriers demonstrated two critical advantages:</p>\n<ul>\n<li>Dramatically reduced distribution costs compared to traditional airlines</li>\n<li>The ability to create and sell ancillary products (bags, seats, expedited boarding, premium services)</li>\n</ul>\n<p>Traditional carriers realized their own websites and direct channels had been neglected, GDS distribution couldn't handle optional service content, and cost reduction became urgent.</p>\n\n<h2>What the GDS Does Well—and Doesn't</h2>\n<p>The traditional GDS offers global reach with established processes (BSP, ARC) and agent flexibility to combine multiple airlines. But as Ann notes, \"The traditional GDS is clunky and not good at distributing content,\" limiting customer experience improvements and maintaining outdated practices.</p>\n\n<h2>The Real Issue: Fragmentation</h2>\n<p>Ann highlights unsustainable fragmentation, citing her 2019 experience where a major TMC couldn't book EasyJet between Copenhagen-Geneva, forcing routing through Zurich. Her answer: \"Aggregation of content from everywhere\" with the customer at the center.</p>\n\n<p><a href=\"https://www.linkedin.com/pulse/why-cant-airlines-explain-ndc-ann-cederhall-voe2f\" target=\"_blank\" rel=\"noopener noreferrer\">Read the full article on LinkedIn →</a></p>"
}
